# Import required packages

In [1]:
import pandas as pd

# Load data

In [34]:
housing_df = pd.read_csv('WestRoxbury.csv')

housing_df.shape # find the dimension of data frame

(5802, 14)

# Import packages

In [35]:
import numpy as np
from sklearn.model_selection import train_test_split
from sklearn.metrics import r2_score
from sklearn.linear_model import LinearRegression

# Explore data

In [36]:
housing_df.head() # show the first five rows, the row index starts with 0

pd.options.display.max_columns = None #show all columns in Console

housing_df.head()

print(housing_df) # show all the data

      TOTAL VALUE    TAX  LOT SQFT   YR BUILT  GROSS AREA   LIVING AREA  \
0            344.2  4330       9965      1880         2436         1352
1            412.6  5190       6590      1945         3108         1976
2            330.1  4152       7500      1890         2294         1371
3            498.6  6272      13773      1957         5032         2608
4            331.5  4170       5000      1910         2370         1438
...            ...   ...        ...       ...          ...          ...
5797         404.8  5092       6762      1938         2594         1714
5798         407.9  5131       9408      1950         2414         1333
5799         406.5  5113       7198      1987         2480         1674
5800         308.7  3883       6890      1946         2000         1000
5801         447.6  5630       7406      1950         2510         1600

      FLOORS   ROOMS  BEDROOMS   FULL BATH  HALF BATH  KITCHEN  FIREPLACE  \
0         2.0      6          3          1          1        1          0
1         2.0     10          4          2          1        1          0
2         2.0      8          4          1          1        1          0
3         1.0      9          5          1          1        1          1
4         2.0      7          3          2          0        1          0
...       ...    ...        ...        ...        ...      ...        ...
5797      2.0      9          3          2          1        1          1
5798      2.0      6          3          1          1        1          1
5799      2.0      7          3          1          1        1          1
5800      1.0      5          2          1          0        1          0
5801      2.0      7          3          1          1        1          1

     REMODEL
0        NaN
1     Recent
2        NaN
3        NaN
4        NaN
...      ...
5797  Recent
5798     NaN
5799     NaN
5800     NaN
5801     NaN

[5802 rows x 14 columns]

# add _ to all columns

for loop in Python https://www.datacamp.com/tutorial/for-loops-in-python

s.strip()... removes any white space
...replace('thing to replace', 'thing that will replace')
for s... s means run through all of the things
housing_df.columns...the things that are going to be run through

In [37]:
housing_df.columns

housing_df.columns = [s.strip().replace(' ', '_') for s in housing_df.columns]

housing_df.columns

Index(['TOTAL_VALUE', 'TAX', 'LOT_SQFT', 'YR_BUILT', 'GROSS_AREA',
       'LIVING_AREA', 'FLOORS', 'ROOMS', 'BEDROOMS', 'FULL_BATH', 'HALF_BATH',
       'KITCHEN', 'FIREPLACE', 'REMODEL'],
      dtype='object')

# Practice showing the first four rows of the data

In [38]:
housing_df.loc[0:3] # loc[a:b] gives rows a to b, inclusive

,TOTAL_VALUE,TAX,LOT_SQFT,YR_BUILT,GROSS_AREA,LIVING_AREA,FLOORS,ROOMS,BEDROOMS,FULL_BATH,HALF_BATH,KITCHEN,FIREPLACE,REMODEL
0,344.2,4330,9965,1880,2436,1352,2.0,6,3,1,1,1,0,NaN
1,412.6,5190,6590,1945,3108,1976,2.0,10,4,2,1,1,0,Recent
2,330.1,4152,7500,1890,2294,1371,2.0,8,4,1,1,1,0,NaN
3,498.6,6272,13773,1957,5032,2608,1.0,9,5,1,1,1,1,NaN

In [39]:
housing_df.iloc[0:4] # iloc[a:b] gives rows a to b-1

,TOTAL_VALUE,TAX,LOT_SQFT,YR_BUILT,GROSS_AREA,LIVING_AREA,FLOORS,ROOMS,BEDROOMS,FULL_BATH,HALF_BATH,KITCHEN,FIREPLACE,REMODEL
0,344.2,4330,9965,1880,2436,1352,2.0,6,3,1,1,1,0,NaN
1,412.6,5190,6590,1945,3108,1976,2.0,10,4,2,1,1,0,Recent
2,330.1,4152,7500,1890,2294,1371,2.0,8,4,1,1,1,0,NaN
3,498.6,6272,13773,1957,5032,2608,1.0,9,5,1,1,1,1,NaN

# Different ways of showing the first 10 values in column TOTAL_VALUE

In [40]:
housing_df['TOTAL_VALUE'].iloc[0:10]

0    344.2
1    412.6
2    330.1
3    498.6
4    331.5
5    337.4
6    359.4
7    320.4
8    333.5
9    409.4
Name: TOTAL_VALUE, dtype: float64

In [41]:
housing_df.iloc[0:10]['TOTAL_VALUE']

0    344.2
1    412.6
2    330.1
3    498.6
4    331.5
5    337.4
6    359.4
7    320.4
8    333.5
9    409.4
Name: TOTAL_VALUE, dtype: float64

In [42]:
housing_df.iloc[0:10].TOTAL_VALUE # use dot notation if the column name has no spaces

0    344.2
1    412.6
2    330.1
3    498.6
4    331.5
5    337.4
6    359.4
7    320.4
8    333.5
9    409.4
Name: TOTAL_VALUE, dtype: float64

# Show the fifth row of the first 10 columns, zero-indexed

In [43]:
housing_df.iloc[4][0:10]

TOTAL_VALUE    331.5
TAX             4170
LOT_SQFT        5000
YR_BUILT        1910
GROSS_AREA      2370
LIVING_AREA     1438
FLOORS           2.0
ROOMS              7
BEDROOMS           3
FULL_BATH          2
Name: 4, dtype: object

In [44]:
housing_df.iloc[4, 0:10]

TOTAL_VALUE    331.5
TAX             4170
LOT_SQFT        5000
YR_BUILT        1910
GROSS_AREA      2370
LIVING_AREA     1438
FLOORS           2.0
ROOMS              7
BEDROOMS           3
FULL_BATH          2
Name: 4, dtype: object

# Use a slice to return a data frame

In [45]:
housing_df.iloc[4:5, 0:10]

,TOTAL_VALUE,TAX,LOT_SQFT,YR_BUILT,GROSS_AREA,LIVING_AREA,FLOORS,ROOMS,BEDROOMS,FULL_BATH
4,331.5,4170,5000,1910,2370,1438,2.0,7,3,2

Use pd.concat to combine non-consecutive columns into a new data frame.

The axis argument specifies the dimension along which the # concatenation happens, 0=rows, 1=columns.

In [46]:
pd.concat([housing_df.iloc[4:6,0:2], 
           housing_df.iloc[4:6,4:6]], 
           axis=1)

   TOTAL_VALUE   TAX  GROSS_AREA  LIVING_AREA
4        331.5  4170        2370         1438
5        337.4  4244        2124         1060

# To specify a full column, use:

In [47]:
housing_df.iloc[:,0:1]

      TOTAL_VALUE
0           344.2
1           412.6
2           330.1
3           498.6
4           331.5
...           ...
5797        404.8
5798        407.9
5799        406.5
5800        308.7
5801        447.6

[5802 rows x 1 columns]

In [48]:
housing_df.TOTAL_VALUE

0       344.2
1       412.6
2       330.1
3       498.6
4       331.5
        ...
5797    404.8
5798    407.9
5799    406.5
5800    308.7
5801    447.6
Name: TOTAL_VALUE, Length: 5802, dtype: float64

In [49]:
housing_df['TOTAL_VALUE'][0:10] # show the first 10 rows of the first column

0    344.2
1    412.6
2    330.1
3    498.6
4    331.5
5    337.4
6    359.4
7    320.4
8    333.5
9    409.4
Name: TOTAL_VALUE, dtype: float64

# Descriptive statistics

In [50]:
print('Number of rows ', len(housing_df['TOTAL_VALUE'])) # show length of first column

Number of rows  5802

In [51]:
print('Mean of TOTAL_VALUE ', housing_df['TOTAL_VALUE'].mean()) # show mean of column

Mean of TOTAL_VALUE  392.6857149258877

In [52]:
housing_df.describe() # show summary statistics for each column

,TOTAL_VALUE,TAX,LOT_SQFT,YR_BUILT,GROSS_AREA,LIVING_AREA,FLOORS,ROOMS,BEDROOMS,FULL_BATH,HALF_BATH,KITCHEN,FIREPLACE
count,5802.000000,5802.000000,5802.000000,5802.000000,5802.000000,5802.000000,5802.000000,5802.000000,5802.000000,5802.000000,5802.000000,5802.00000,5802.000000
mean,392.685715,4939.485867,6278.083764,1936.744916,2924.842123,1657.065322,1.683730,6.994829,3.230093,1.296794,0.613926,1.01534,0.739917
std,99.177414,1247.649118,2669.707974,35.989910,883.984726,540.456726,0.444884,1.437657,0.846607,0.522040,0.533839,0.12291,0.565108
min,105.000000,1320.000000,997.000000,0.000000,821.000000,504.000000,1.000000,3.000000,1.000000,1.000000,0.000000,1.00000,0.000000
25%,325.125000,4089.500000,4772.000000,1920.000000,2347.000000,1308.000000,1.000000,6.000000,3.000000,1.000000,0.000000,1.00000,0.000000
50%,375.900000,4728.000000,5683.000000,1935.000000,2700.000000,1548.500000,2.000000,7.000000,3.000000,1.000000,1.000000,1.00000,1.000000
75%,438.775000,5519.500000,7022.250000,1955.000000,3239.000000,1873.750000,2.000000,8.000000,4.000000,2.000000,1.000000,1.00000,1.000000
max,1217.800000,15319.000000,46411.000000,2011.000000,8154.000000,5289.000000,3.000000,14.000000,9.000000,5.000000,3.000000,2.00000,4.000000

# Sampling in pandas

## random sample of 5 observations

In [53]:
housing_df.sample(5)

,TOTAL_VALUE,TAX,LOT_SQFT,YR_BUILT,GROSS_AREA,LIVING_AREA,FLOORS,ROOMS,BEDROOMS,FULL_BATH,HALF_BATH,KITCHEN,FIREPLACE,REMODEL
3638,324.2,4078,5000,1930,3384,1383,1.0,5,2,1,0,1,1,NaN
2071,404.1,5083,6688,1938,2510,1350,2.0,6,3,1,1,1,1,NaN
2121,471.4,5930,8119,1938,2854,1600,2.0,6,3,1,1,1,1,NaN
3454,417.1,5247,6285,1975,2664,1720,2.0,7,3,2,0,1,1,NaN
3715,411.0,5170,5387,1920,2823,1932,2.0,11,4,1,1,1,1,Recent

## oversample houses with over 10 rooms

### weights

In [54]:
# Counts of each distinct value in a colum
housing_df.ROOMS.value_counts()

ROOMS
7     1769
6     1669
8      936
5      578
9      450
10     200
4       71
11      66
12      45
13      10
14       5
3        3
Name: count, dtype: int64

In [55]:
# what to do
# named variable (choose any name)
# The column to do it to
weights = [0.9 if rooms > 10 else 0.01 
           for rooms in 
           housing_df.ROOMS]

weights[0:10]

[0.01, 0.01, 0.01, 0.01, 0.01, 0.01, 0.01, 0.01, 0.01, 0.01]

## oversample

### sample 5 rows based on weights

In [56]:
housing_df.sample(5, weights=weights)

,TOTAL_VALUE,TAX,LOT_SQFT,YR_BUILT,GROSS_AREA,LIVING_AREA,FLOORS,ROOMS,BEDROOMS,FULL_BATH,HALF_BATH,KITCHEN,FIREPLACE,REMODEL
1611,313.4,3942,6036,1945,2244,1028,1.0,5,2,1,0,1,1,Old
1565,284.9,3584,4144,1960,2368,1306,1.5,6,3,2,0,1,0,NaN
4603,742.4,9339,12600,1884,6224,3298,2.0,11,7,2,1,1,2,Recent
4199,701.8,8828,9716,1940,5140,3446,2.0,11,4,2,1,1,2,Recent
1850,505.6,6360,7205,1954,4996,2375,1.5,11,6,3,0,2,0,NaN

# Reviewing variables in pandas

In [57]:
housing_df.columns # print a list of variables

Index(['TOTAL_VALUE', 'TAX', 'LOT_SQFT', 'YR_BUILT', 'GROSS_AREA',
       'LIVING_AREA', 'FLOORS', 'ROOMS', 'BEDROOMS', 'FULL_BATH', 'HALF_BATH',
       'KITCHEN', 'FIREPLACE', 'REMODEL'],
      dtype='object')

In [58]:
housing_df.dtypes #show the type of variables

TOTAL_VALUE    float64
TAX              int64
LOT_SQFT         int64
YR_BUILT         int64
GROSS_AREA       int64
LIVING_AREA      int64
FLOORS         float64
ROOMS            int64
BEDROOMS         int64
FULL_BATH        int64
HALF_BATH        int64
KITCHEN          int64
FIREPLACE        int64
REMODEL         object
dtype: object

In [59]:
# Save the data type information as a dictionary object
# The first character specifies the kind of data, 
# and the remaining characters specify the number of bytes per item
# 'O'     (Python) objects/Python type string
DataTypeDict = dict(housing_df.dtypes) # check column data type

DataTypeDict

{'TOTAL_VALUE': dtype('float64'),
 'TAX': dtype('int64'),
 'LOT_SQFT': dtype('int64'),
 'YR_BUILT': dtype('int64'),
 'GROSS_AREA': dtype('int64'),
 'LIVING_AREA': dtype('int64'),
 'FLOORS': dtype('float64'),
 'ROOMS': dtype('int64'),
 'BEDROOMS': dtype('int64'),
 'FULL_BATH': dtype('int64'),
 'HALF_BATH': dtype('int64'),
 'KITCHEN': dtype('int64'),
 'FIREPLACE': dtype('int64'),
 'REMODEL': dtype('O')}

In [60]:
housing_df.dtypes

TOTAL_VALUE    float64
TAX              int64
LOT_SQFT         int64
YR_BUILT         int64
GROSS_AREA       int64
LIVING_AREA      int64
FLOORS         float64
ROOMS            int64
BEDROOMS         int64
FULL_BATH        int64
HALF_BATH        int64
KITCHEN          int64
FIREPLACE        int64
REMODEL         object
dtype: object

In [61]:
# REMODEL needs to be converted to a categorical variable
housing_df.REMODEL = housing_df.REMODEL.astype('category')

housing_df.REMODEL.cat.categories # Show categories

Index(['Old', 'Recent'], dtype='object')

In [62]:
housing_df.REMODEL.dtype # Check type of converted variable

CategoricalDtype(categories=['Old', 'Recent'], ordered=False)

# Creating Dummy Variables in pandas

## use drop_first=True to drop the first dummy variable

In [63]:
housing_df.columns

Index(['TOTAL_VALUE', 'TAX', 'LOT_SQFT', 'YR_BUILT', 'GROSS_AREA',
       'LIVING_AREA', 'FLOORS', 'ROOMS', 'BEDROOMS', 'FULL_BATH', 'HALF_BATH',
       'KITCHEN', 'FIREPLACE', 'REMODEL'],
      dtype='object')

In [64]:
housing_df = pd.get_dummies(housing_df, prefix_sep='_', drop_first=True)
housing_df.columns
# housing_df.loc[:, 'REMODEL_Old':'REMODEL_Recent'].head(5)

Index(['TOTAL_VALUE', 'TAX', 'LOT_SQFT', 'YR_BUILT', 'GROSS_AREA',
       'LIVING_AREA', 'FLOORS', 'ROOMS', 'BEDROOMS', 'FULL_BATH', 'HALF_BATH',
       'KITCHEN', 'FIREPLACE', 'REMODEL_Recent'],
      dtype='object')

# Missing Data

## To illustrate missing data procedures, we first convert a few entries for bedrooms to NA's. 
## Then we impute these missing values using the median of the remaining values.

In [67]:
missingRows = housing_df.sample(10).index
missingRows

Index([2243, 3128, 4109, 2444, 623, 2334, 144, 1386, 2847, 3941], dtype='int64')

In [69]:
housing_df.loc[missingRows, 'BEDROOMS'] = np.nan # not a number indicate missing
len(housing_df['BEDROOMS'])

5802

In [70]:
print('Number of rows with valid BEDROOMS values after setting to NAN: ', housing_df['BEDROOMS'].count())

Number of rows with valid BEDROOMS values after setting to NAN:  5792

In [71]:
# remove rows with missing values
reduced_df = housing_df.dropna()

print('Number of rows after removing rows with missing values: ', len(reduced_df))

Number of rows after removing rows with missing values:  5792

## Impute values

In [72]:
# replace the missing values using the median of the remaining values.
#calculate median value 
medianBedrooms = housing_df['BEDROOMS'].median() 
medianBedrooms

3.0

In [73]:
# replace the missing values with the median value
housing_df.BEDROOMS = housing_df.BEDROOMS.fillna(value=medianBedrooms) 

print('Number of rows with valid BEDROOMS values after filling NA values: ', housing_df['BEDROOMS'].count())

Number of rows with valid BEDROOMS values after filling NA values:  5802

# Table 2.8: Normalizing and rescaling data

In [74]:
from sklearn.preprocessing import MinMaxScaler, StandardScaler

# Copy of housing data
df = housing_df.copy()

## Normalizing a data frame

### pandas:

In [ ]:
#housing_df.head() #original values # original values
#norm_df = (housing_df - housing_df.mean()) / housing_df.std() #normalized values
#norm_df.head() #normalized values

### scikit-learn:

In [75]:
scaler = MinMaxScaler()

norm_df = pd.DataFrame(scaler.fit_transform(housing_df), 
                       index=housing_df.index, 
                       columns=housing_df.columns)

norm_df.head()

,TOTAL_VALUE,TAX,LOT_SQFT,YR_BUILT,GROSS_AREA,LIVING_AREA,FLOORS,ROOMS,BEDROOMS,FULL_BATH,HALF_BATH,KITCHEN,FIREPLACE,REMODEL_Recent
0,0.214953,0.215015,0.197472,0.934858,0.220237,0.177220,0.5,0.272727,0.250,0.00,0.333333,0.0,0.00,0.0
1,0.276420,0.276448,0.123156,0.967181,0.311878,0.307628,0.5,0.636364,0.375,0.25,0.333333,0.0,0.00,1.0
2,0.202283,0.202300,0.143194,0.939831,0.200873,0.181191,0.5,0.454545,0.375,0.00,0.333333,0.0,0.00,0.0
3,0.353702,0.353740,0.281323,0.973148,0.574253,0.439707,0.0,0.545455,0.500,0.00,0.333333,0.0,0.25,0.0
4,0.203541,0.203586,0.088145,0.949776,0.211237,0.195193,0.5,0.363636,0.250,0.25,0.000000,0.0,0.00,0.0

# Data Partitioning in Python

In [76]:
# random_state is set to a defined value to get the same partitions when re-running
# Pass an int for reproducible output across multiple function calls
# training 60% and validation 40%
trainData, validData = train_test_split(housing_df, 
                                        test_size=0.40, 
                                        random_state=1)
print('Training : ', trainData.shape)
print('Validation : ', validData.shape)

Training :  (3481, 14)
Validation :  (2321, 14)